app/views/usuarios/index.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".usuario_id = 1)
---
<b>Usuario: </b><%= u.nombre %><br />
<% u.comments.each do |c| %>