app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 1)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "comments" WHERE ("comments".post_id = 1)) AS subquery
---
<b>Info: </b><%= @post.content %><br /><br /><br />
<b>Comments: <%= @post.comments.size %></b><br />