app/controllers/comments_controller.rb

  def create
    @newComment = Comment.new(params[:comment])
    if @newComment.save
---
INSERT INTO "comments" ("created_at", "message", "post_id", "updated_at", "usuario_id") VALUES ('2010-11-30 20:09:00.953125', NULL, NULL, '2010-11-30 20:09:00.953125', NULL)