app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "usuario_id") VALUES ('we are testing this new feature, we can create new post. we are testing this new feature, we can create new post. we are testing this new feature, we can create new post. we are testing this new feature, we can create new post.
---
  def create
    @post = Post.new(params[:post])
	if @post.save