app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("apellido", "created_at", "edad", "nombre", "updated_at") VALUES ('Muldo', '2010-11-30 02:01:35.093750', 34, 'Jorge', '2010-11-30 02:01:35.093750')
---
  def create
	@usuario = Usuario.new(params[:usuario])
	unless @usuario.save